{"_name_or_path": "dslim/bert-base-NER", "_num_labels": 9, "architectures": ["BertForTokenClassification"], "attention_probs_dropout_prob": 0.1, "classifier_dropout": null, "hidden_act": "gelu", "hidden_dropout_prob": 0.1, "hidden_size": 768, "id2label": {"0": "B-Mountain", "1": "I-Mountain", "2": "O"}, "initializer_range": 0.02, "intermediate_size": 3072, "label2id": {"B-Mountain": 0, "I-Mountain": 1, "O": 2}, "layer_norm_eps": 1e-12, "max_position_embeddings": 512, "model_type": "bert", "num_attention_heads": 12, "num_hidden_layers": 10, "output_past": true, "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.35.2", "type_vocab_size": 2, "use_cache": true, "vocab_size": 28996}